In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.863232 -0.701541
1    a  two  1.569370  1.312324
2    b  one  0.217066 -0.905002
3    b  two -0.718592  0.656871
4    a  one -0.808658 -1.704406

In [2]:
df.groupby('key1')

In [3]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.863232 -0.701541
1    a  two  1.569370  1.312324
4    a  one -0.808658 -1.704406
b
  key1 key2     data1     data2
2    b  one  0.217066 -0.905002
3    b  two -0.718592  0.656871

In [4]:
for name,group in df.groupby(['key1','key2']):
    print(name)
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one -0.863232 -0.701541
4    a  one -0.808658 -1.704406
('a', 'two')
  key1 key2    data1     data2
1    a  two  1.56937  1.312324
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.217066 -0.905002
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.718592  0.656871

In [5]:
list(df.groupby('key1'))

[('a',
    key1 key2     data1     data2
  0    a  one -0.863232 -0.701541
  1    a  two  1.569370  1.312324
  4    a  one -0.808658 -1.704406),
 ('b',
    key1 key2     data1     data2
  2    b  one  0.217066 -0.905002
  3    b  two -0.718592  0.656871)]

In [6]:
dict(list(df.groupby('key1')))

{'a':   key1 key2     data1     data2
 0    a  one -0.863232 -0.701541
 1    a  two  1.569370  1.312324
 4    a  one -0.808658 -1.704406,
 'b':   key1 key2     data1     data2
 2    b  one  0.217066 -0.905002
 3    b  two -0.718592  0.656871}

In [7]:
dict(list(df.groupby('key1')))['a']

  key1 key2     data1     data2
0    a  one -0.863232 -0.701541
1    a  two  1.569370  1.312324
4    a  one -0.808658 -1.704406

In [8]:
dict(list(df.groupby('key1')))['b']

  key1 key2     data1     data2
2    b  one  0.217066 -0.905002
3    b  two -0.718592  0.656871

In [9]:
dict(list(df.groupby(['key1','key2'])))

{('a',
  'one'):   key1 key2     data1     data2
 0    a  one -0.863232 -0.701541
 4    a  one -0.808658 -1.704406,
 ('a',
  'two'):   key1 key2    data1     data2
 1    a  two  1.56937  1.312324,
 ('b',
  'one'):   key1 key2     data1     data2
 2    b  one  0.217066 -0.905002,
 ('b',
  'two'):   key1 key2     data1     data2
 3    b  two -0.718592  0.656871}

In [10]:
dict(list(df.groupby(['key1','key2'])))[('a','one')]

  key1 key2     data1     data2
0    a  one -0.863232 -0.701541
4    a  one -0.808658 -1.704406

In [11]:
grouped = df.groupby('key1')
len(grouped)

2

In [12]:
dict(list(grouped))

{'a':   key1 key2     data1     data2
 0    a  one -0.863232 -0.701541
 1    a  two  1.569370  1.312324
 4    a  one -0.808658 -1.704406,
 'b':   key1 key2     data1     data2
 2    b  one  0.217066 -0.905002
 3    b  two -0.718592  0.656871}

In [13]:
grouped['data1'].mean()

key1
a   -0.034174
b   -0.250763
Name: data1, dtype: float64

In [14]:
grouped['data1'].agg(['mean','sum','max','min'])

          mean       sum       max       min
key1
a    -0.034174 -0.102521  1.569370 -0.863232
b    -0.250763 -0.501526  0.217066 -0.718592